
#include "../includes.hpp"

#include <Windows.h>
#include <WinInet.h>
#include "skins.h"
#include "../inventory/items.h"
#include "parser.h"
#include <array>
#include "../inventory/inventorychanger.h"

Skins g_Skins;
struct skin_info
{
	int seed = -1;
	int paintkit;
	int rarity = 0;
	std::string tag_name;
	std::string cdn_name;
};

#pragma comment(lib, "Wininet")

CreateClientClassFn GetWearableCreateFn()
{
	auto clazz = m_client()->GetAllClasses();
	// Please, if you gonna paste it into a cheat use classids here. I use names because they
	// won't change in the foreseeable future and i dont need high speed, but chances are
	// you already have classids, so use them instead, they are faster.
	while (strcmp(clazz->m_pNetworkName, "CEconWearable"))
		clazz = clazz->m_pNext;
	return clazz->m_pCreateFn;
}

const weapon_info* GetWeaponInfo(const short& defindex)
{
	const auto entry = k_weapon_info.find(defindex);

	return entry == k_weapon_info.end() ? nullptr : &entry->second;
}

void Skins::EraseOverrideIfExistsByIndex(const short definition_index)
{
	if (const auto original_item = GetWeaponInfo(definition_index))
	{
		if (!original_item->icon)
			return;

		const auto override_entry = m_icon_overrides.find(original_item->icon);
		if (override_entry != std::end(m_icon_overrides))
			m_icon_overrides.erase(override_entry);
	}
}

const char* Skins::GetIconOverride(const std::string& original)
{
	return m_icon_overrides.count(original) > 0 ? m_icon_overrides.at(original).data() : nullptr;
}

int GetWeaponRarity(std::string rarity)
{
	if (rarity == "default")
		return 0;
	else if (rarity == "common")
		return 1;
	else if (rarity == "uncommon")
		return 2;
	else if (rarity == "rare")
		return 3;
	else if (rarity == "mythical")
		return 4;
	else if (rarity == "legendary")
		return 5;
	else if (rarity == "ancient")
		return 6;
	else if (rarity == "immortal")
		return 7;
	else if (rarity == "unusual")
		return 99;

	return 0;
}



void ParseMedals()
{
	valve_parser::Document items_document;
	bool item_document_loaded = items_document.Load(".\\csgo\\scripts\\items\\items_game.txt", valve_parser::ENCODING::UTF8);
	if (!item_document_loaded)
		return;

	auto items = items_document.BreadthFirstSearch("items");
	if (!items || !items->ToObject())
		return;

	int i = 0;

	for (auto child : items->children)
	{
		if (child->ToObject())
		{
			std::string object_id = child->ToObject()->name.toString();

			if ((atoi(object_id.c_str()) >= 874) && (atoi(object_id.c_str()) <= 6133))
			{
				std::string object_prefab = child->ToObject()->GetKeyByName("prefab")->ToKeyValue()->Value.toString();

				if ((object_prefab != "collectible_untradable") && (object_prefab != "operation_coin") && (object_prefab != "prestige_coin")
					&& (object_prefab != "attendance_pin") && (object_prefab != "commodity_pin") && (object_prefab != "season1_coin")
					&& (object_prefab != "season2_coin") && (object_prefab != "season3_coin") && (object_prefab != "season4_coin")
					&& (object_prefab != "season5_coin") && (object_prefab != "season6_coin") && (object_prefab != "season7_coin")
					&& (object_prefab != "season8_coin")) continue;

				std::string object_name = child->ToObject()->GetKeyByName("name")->ToKeyValue()->Value.toString();
				
				
				fosso[atoi(object_id.c_str())] = { object_name, atoi(object_id.c_str()) };

				i++;
				if ((atoi(object_id.c_str()) == 6133))
					break;
			}
		}
	}
	
	//for (size_t i = 0; i < G::MedalMap.size(); i++)
	//{
	//	G::MedalList.push_back(G::MedalMap.at(i).medal_name.c_str());
	//}
}

namespace fzdetail
{
	constexpr auto process_pattern_byte(const std::pair<char, char> pair) -> std::pair<std::uint8_t, bool>
	{
		return { std::uint8_t(pair.first), pair.second == 'x' };
	}

	template <std::size_t N>
	constexpr auto select_pattern_byte(const char(&pattern)[N], const char(&mask)[N], std::size_t n) -> std::pair<char, char>
	{
		return { pattern[n], mask[n] };
	}

	template <typename>
	struct sig_processor {};

	template <std::size_t... Indices>
	struct sig_processor<std::index_sequence<Indices...>>
	{
		template <std::size_t N>
		static constexpr auto process(const char(&pattern)[N], const char(&mask)[N])->std::array<std::pair<std::uint8_t, bool>, N>
		{
			return { process_pattern_byte(select_pattern_byte(pattern, mask, Indices))... };
		}
	};
}

auto get_module_info(const char* module_name) -> std::pair<std::uintptr_t, std::size_t>
{
	const auto module = GetModuleHandleA(module_name);
	if (!module)
		return { 0, 0 };
	MODULEINFO module_info;
	K32GetModuleInformation(GetCurrentProcess(), module, &module_info, sizeof(MODULEINFO));
	return { std::uintptr_t(module_info.lpBaseOfDll), module_info.SizeOfImage };
}



template <std::size_t N>
auto find_pattern(const char* module_name, const char(&pattern)[N], const char(&mask)[N]) -> std::uintptr_t
{
	const std::array<std::pair<std::uint8_t, bool>, N> signature = fzdetail::sig_processor<std::make_index_sequence<N>>::process(pattern, mask);

	const auto info = get_module_info(module_name);
	const auto address = reinterpret_cast<std::uint8_t*>(info.first);
	const auto size = info.second;

	const auto ret = std::search(address, address + size, signature.begin(), signature.end(),
		[](std::uint8_t curr, std::pair<std::uint8_t, bool> curr_pattern)
		{
			return (!curr_pattern.second) || curr == curr_pattern.first;
		});

	return ret == address + size ? 0 : std::uintptr_t(ret);
}

template <typename Key, typename Value>
struct Node_t
{
	int previous_id;		//0x0000
	int next_id;			//0x0004
	void* _unknown_ptr;		//0x0008
	int _unknown;			//0x000C
	Key key;				//0x0010
	Value value;			//0x0014
};


template <typename Key, typename Value>
struct Head_t
{
	Node_t<Key, Value>* memory;		//0x0000
	int allocation_count;			//0x0004
	int grow_size;					//0x0008
	int start_element;				//0x000C
	int next_available;				//0x0010
	int _unknown;					//0x0014
	int last_element;				//0x0018
}; //Size=0x001C

// could use CUtlString but this is just easier and CUtlString isn't needed anywhere else
struct String_t
{
	char* buffer;	//0x0000
	int capacity;	//0x0004
	int grow_size;	//0x0008
	int length;		//0x000C
}; //Size=0x0010

class CCStrike15ItemSystem;
class CCStrike15ItemSchema;
struct CPaintKit
{
	int id;						//0x0000

	String_t name;				//0x0004
	String_t description;		//0x0014
	String_t item_name;			//0x0024
	String_t material_name;		//0x0034
	String_t image_inventory;	//0x0044

	char pad_0x0054[0x8C];		//0x0054
}; //Size=0x00E0

struct CStickerKit
{
	int id;

	int item_rarity;

	String_t name;
	String_t description;
	String_t item_name;
	String_t material_name;
	String_t image_inventory;

	int tournament_event_id;
	int tournament_team_id;
	int tournament_player_id;
	bool is_custom_sticker_material;

	float rotate_end;
	float rotate_start;

	float scale_min;
	float scale_max;

	float wear_min;
	float wear_max;

	String_t image_inventory2;
	String_t image_inventory_large;

	std::uint32_t pad0[4];
};
auto zget_export(const char* module_name, const char* export_name) -> void*
{
	HMODULE mod;
	while (!((mod = GetModuleHandleA(module_name))))
		Sleep(100);

	return reinterpret_cast<void*>(GetProcAddress(mod, export_name));
}


#include "enrage parser, thanks!/parserz.hpp"

void Skins::ParseSkins() const
{

	parser::parse();



	const auto V_UCS2ToUTF8 = static_cast<int(*)(const wchar_t* ucs2, char* utf8, int len)>(zget_export("vstdlib.dll", "V_UCS2ToUTF8"));


